stm32-rs/stm32wlxx-hal/subghz/src/lib.rs
//! The sub-GHz radio is an ultra-low-power sub-GHz radio operating in the
//! 150 - 960 MHz ISM band.
#![cfg_attr(not(test), no_std)]

mod cad_params;
mod calibrate;
mod fallback_mode;
mod irq;
mod lora_sync_word;
mod mod_params;
mod ocp;
mod op_error;
mod pa_config;
mod packet_params;
mod packet_status;
mod packet_type;
mod reg_mode;
mod rf_frequency;
mod rx_timeout_stop;
mod sleep_cfg;
mod standby_clk;
mod stats;
mod status;
mod tcxo_mode;
mod timeout;
mod tx_params;
mod value_error;

pub use cad_params::{CadParams, ExitMode, NbCadSymbol};
pub use calibrate::{Calibrate, CalibrateImage};
pub use fallback_mode::FallbackMode;
pub use irq::{CfgDioIrq, Irq, IrqLine};
pub use lora_sync_word::LoRaSyncWord;
pub use mod_params::BpskModParams;
pub use mod_params::{CodingRate, LoRaBandwidth, LoRaModParams, SpreadingFactor};
pub use mod_params::{FskBandwidth, FskBitrate, FskFdev, FskModParams, FskPulseShape};
pub use ocp::Ocp;
pub use op_error::OpError;
pub use pa_config::{PaConfig, PaSel};
pub use packet_params::{
    AddrComp, BpskPacketParams, CrcType, GenericPacketParams, HeaderType, LoRaPacketParams,
    PreambleDetection,
};
pub use packet_status::{FskPacketStatus, LoRaPacketStatus};
pub use packet_type::PacketType;
pub use reg_mode::RegMode;
pub use rf_frequency::RfFreq;
pub use rx_timeout_stop::RxTimeoutStop;
pub use sleep_cfg::{SleepCfg, Startup};
pub use standby_clk::StandbyClk;
pub use stats::{FskStats, LoRaStats, Stats};
pub use status::{CmdStatus, Status, StatusMode};
pub use tcxo_mode::{TcxoMode, TcxoTrim};
pub use timeout::Timeout;
pub use tx_params::{RampTime, TxParams};
pub use value_error::ValueError;

use core::{
    convert::Infallible,
    ptr::{read_volatile, write_volatile},
};

pub use num_rational;

use num_rational::Ratio;

cfg_if::cfg_if! {
    if #[cfg(feature = "stm32wl5x_cm0p")] {
        /// Peripheral access crate.
        pub use stm32wl::stm32wl5x_cm0p as pac;
    } else if #[cfg(feature = "stm32wl5x_cm4")] {
        /// Peripheral access crate.
        pub use stm32wl::stm32wl5x_cm4 as pac;
    } else if #[cfg(feature = "stm32wle5")] {
        /// Peripheral access crate.
        pub use stm32wl::stm32wle5 as pac;
    } else {
        core::compile_error!("You must select your hardware with a feature flag");
    }
}

/// Errors?  What errors!  TODO.
pub type SubGhzError = Infallible;

/// sub-GHz radio peripheral.
pub struct SubGhz {
    spi: pac::SPI3,
}

impl SubGhz {
    /// Create a new sub-GHz radio driver from a peripheral.
    ///
    /// This will initialize the SPI bus, and bring the radio out of reset,
    /// but it will **not** enable the clocks on the radio.
    ///
    /// # Example
    ///
    /// ```no_run
    /// use stm32wl_hal_subghz::{pac, SubGhz};
    ///
    /// let dp: pac::Peripherals = pac::Peripherals::take().unwrap();
    /// let mut rcc = dp.RCC;
    /// let pwr = dp.PWR;
    ///
    /// // ... setup the system clocks
    ///
    /// rcc.apb3enr.modify(|_, w| w.subghzspien().set_bit());
    /// rcc.csr.modify(|_, w| w.rfrst().clear_bit());
    /// pwr.subghzspicr.write(|w| w.nss().clear_bit());
    /// pwr.subghzspicr.write(|w| w.nss().set_bit());
    ///
    /// let sg = SubGhz::new(dp.SPI3, &mut rcc);
    /// ```
    pub fn new(spi: pac::SPI3, rcc: &mut pac::RCC) -> SubGhz {
        rcc.apb3rstr.write(|w| w.subghzspirst().set_bit());
        rcc.apb3rstr.write(|w| w.subghzspirst().clear_bit());

        #[rustfmt::skip]
        spi.cr2.write(|w| unsafe {
            w
                // 8-bit data size
                .ds().bits(0b111)
                // RXNE generated on 8-bits
                .frxth().set_bit()
        });

        #[rustfmt::skip]
        spi.cr1.write(|w| unsafe {
            w
                // SPI clock phase 0
                .cpha().clear_bit()
                // SPI clock polarity 0
                .cpol().clear_bit()
                // SPI is a master device
                .mstr().set_bit()
                // this is an internal device - no baud rate divisor necessary
                .br().bits(0b000)
                // LSB first
                .lsbfirst().clear_bit()
                // enable software slave management
                .ssm().set_bit()
                .ssi().set_bit()
                // Full duplex
                .rxonly().clear_bit()
                .bidioe().clear_bit()
                .bidimode().clear_bit()
                // Enable the SPI peripheral
                .spe().set_bit()
        });

        SubGhz { spi }
    }

    /// Magically creates a radio peripheral out of thin air.
    ///
    /// This will **not** initialize the SPI bus (unlike [`new`]).
    ///
    /// # Safety
    ///
    /// This will create a new `SPI3` peripheral, bypassing the singleton checks
    /// that normally occur.
    /// You are responsible for ensuring that the radio has exclusive access to
    /// these peripherals.
    ///
    /// # Example
    ///
    /// ```
    /// use stm32wl_hal_subghz::SubGhz;
    ///
    /// // ... setup happens here
    ///
    /// let sg = unsafe { SubGhz::conjure() };
    /// ```
    ///
    /// [`new`]: SubGhz::new
    pub unsafe fn conjure() -> SubGhz {
        let dp: pac::Peripherals = pac::Peripherals::steal();
        SubGhz { spi: dp.SPI3 }
    }

    /// Returns `true` if RFBUSYS is high.
    ///
    /// This indicates the radio is busy.
    ///
    /// See section 6.3 "Radio busy management" for more details.
    pub fn rfbusys(&self) -> bool {
        let dp = unsafe { pac::Peripherals::steal() };
        dp.PWR.sr2.read().rfbusys().bit_is_set()
    }

    fn poll_not_busy(&self) {
        let mut count: u32 = 100_000;
        while self.rfbusys() {
            count -= 1;
            if count == 0 {
                let dp = unsafe { pac::Peripherals::steal() };
                panic!(
                    "pwr.sr2=0x{:X} pwr.subghzspicr=0x{:X} pwr.cr1=0x{:X}",
                    dp.PWR.sr2.read().bits(),
                    dp.PWR.subghzspicr.read().bits(),
                    dp.PWR.cr1.read().bits(),
                );
            }
        }
    }

